{
    "language": "MultiValue PROC",
    "keywords": [
        {
            "key": "A",
            "documentation": "Copies a parameter from the active input buffer to the active output buffer. The parameter remains in the input buffer.",
            "detail": "A [*surround-char*] [*parameter#*] [*,#characters*]"
        },
        {
            "key": "B",
            "documentation": "Moves the pointer for the currently active input buffer backward to the first character of the previous parameter.",
            "detail": "B"
        },
        {
            "key": "BO",
            "documentation": "Moves the output buffer pointer back to the end of the previous field, discarding the characters it moves over.",
            "detail": "BO"
        },
        {
            "key": "C",
            "documentation": "Specifies a comment line.",
            "detail": "C [*text*]"
        },
        {
            "key": "D",
            "documentation": "Displays one or more fields from the active input buffer.",
            "detail": "D [*reference#* | *parameter#*] [*,#characters*] [*+*]"
        },
        {
            "key": "F",
            "documentation": "Moves the input buffer pointer forward to the next parameter in the active input buffer.",
            "detail": "F"
        },
        {
            "key": "GO",
            "documentation": "Transfers control to another command within a PROC, and continues to execute from that command.",
            "detail": "GOTO|GO|G {*label#* | A [*parameter#*]}"
        },
        {
            "key": "H",
            "documentation": "Adds a string of text to the end of the active output buffer, and positions the pointer at the end of the string.",
            "detail": "H [*text*] [<]"
        },
        {
            "key": "IF",
            "documentation": "Evaluates a condition and, if it is true, executes the specified PROC command. \nIf the command is false, the PROC command does not execute.\n***\n",
            "detail": "IF *condition* *command*"
        },
        {
            "key": "IH",
            "documentation": "Replaces the current parameter in the active input buffer with specified text.",
            "detail": "IH *text*"
        },
        {
            "key": "IP",
            "documentation": "Reads input from the terminal and places it in the active input buffer at the position specified by the input buffer pointer.",
            "detail": "IP [B] [*character*]"
        },
        {
            "key": "IS",
            "documentation": "Reads input from the terminal and places it in the secondary input buffer, replacing the current contents.",
            "detail": "IS [*character*]"
        },
        {
            "key": "IT",
            "documentation": "Reads a backup medium label from an attached backup medium into the primary input buffer.",
            "detail": "IT"
        },
        {
            "key": "O",
            "documentation": "Outputs a string of text to the terminal, followed by a carriage return.",
            "detail": "O *text* [+]"
        },
        {
            "key": "P",
            "documentation": "Submits the command constructed in the primary output buffer to the TCL command processor.",
            "detail": "P [H | P | W | X]"
        },
        {
            "key": "RI",
            "documentation": "Clears both input buffers and makes the primary input buffer active. The command can also be used to clear only a portion of the primary input buffer.",
            "detail": "RI [*parameter#*]"
        },
        {
            "key": "RO",
            "documentation": "Clears both output buffers and makes the primary output buffer active.",
            "detail": "RO"
        },
        {
            "key": "S",
            "documentation": "Sets the input buffer pointer for the currently active input buffer.",
            "detail": "S *parameter#*"
        },
        {
            "key": "SP",
            "documentation": "Selects the primary input buffer as the active input buffer, and positions the pointer at the beginning of the buffer.",
            "detail": "SP"
        },
        {
            "key": "SS",
            "documentation": "Selects the secondary input buffer as the currently active input buffer, and positions the pointer at the beginning of the buffer.",
            "detail": "SS"
        },
        {
            "key": "STOFF",
            "documentation": "Turns off the stack, or secondary output buffer, and makes the primary output buffer active.",
            "detail": "STOFF|ST OFF"
        },
        {
            "key": "STON",
            "documentation": "Makes the secondary output buffer, or stack, active. The stack holds responses for an interactive processor such as mvBASIC or the Editor.",
            "detail": "STON|ST ON"
        },
        {
            "key": "T",
            "documentation": "Formats the display of output on the terminal screen.",
            "detail": "T *option* [*,option…*]"
        },
        {
            "key": "X",
            "documentation": "Terminates a Proc and returns control to TCL. The X command also marks the end of a local or external subroutine defined with the [ ] (call) command.",
            "detail": "X [*text*]"
        },
        {
            "key": "Statement Label",
		    "documentation": "A number specifying a labelled PROC statement.",
		    "detail": "*number*"
        },
        {
            "key":"IF E Condition",
            "documentation": "Evaluates an error condition returned by a command that the UniVerse command processor executes. E must be used after a P command.",
            "detail": "IF [#] E [[*rel-op*] *error*] *command*"
        },
        {
            "key":"IF S Condition",
            "documentation": "Tests whether an active select list is available for processing. It is evaluated as true only if a SELECT or SSELECT sentence was executed by the UniVerse command processor.",
            "detail": "IF [#] S *command*"
        }
    ]
}
